w4d1/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    # your code here
    @books = Book.all

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "fds"], ["author", "sdfa"], ["created_at", "2017-12-31 07:00:01.636127"], ["updated_at", "2017-12-31 07:00:01.636127"]]
---
  def create
    # your code here
    Book.create(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
  def destroy
    # your code here
    book = Book.find(params[:id])
    book.destroy